src/Resources/GetCookie.xml

<Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns="http://www.w3.org/2003/05/soap-envelope">
    <Header>
        <Action d3p1:mustUnderstand="1" xmlns:d3p1="http://www.w3.org/2003/05/soap-envelope"
            xmlns="http://www.w3.org/2005/08/addressing">
            http://www.microsoft.com/SoftwareDistribution/Server/ClientWebService/GetCookie</Action>
        <To d3p1:mustUnderstand="1" xmlns:d3p1="http://www.w3.org/2003/05/soap-envelope"
            xmlns="http://www.w3.org/2005/08/addressing">
            https://fe3.delivery.mp.microsoft.com/ClientWebService/client.asmx</To>
        <Security d3p1:mustUnderstand="1" xmlns:d3p1="http://www.w3.org/2003/05/soap-envelope"
            xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <WindowsUpdateTicketsToken d4p1:id="ClientMSA"
                xmlns:d4p1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                xmlns="http://schemas.microsoft.com/msus/2014/10/WindowsUpdateAuthorization">
            </WindowsUpdateTicketsToken>
        </Security>
    </Header>

    <Body>
        <GetCookie xmlns="http://www.microsoft.com/SoftwareDistribution/Server/ClientWebService" />
    </Body>
</Envelope>